payPostpaidHotBill/templates/payloads/Payment.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
   <soapenv:Header/>
   <soapenv:Body>
      <ars:PaymentRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:MessageSeq>{{ datetime }}</cbs:MessageSeq>
            <cbs:OwnershipInfo>
               <cbs:BEID>101</cbs:BEID>
               <cbs:BRID>101</cbs:BRID>
            </cbs:OwnershipInfo>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <PaymentRequest>
            <ars:PaymentSerialNo>9235000026ABC202450918</ars:PaymentSerialNo>
            <ars:PaymentChannelID>1</ars:PaymentChannelID>
            <ars:OpType>2</ars:OpType>
            <ars:PaymentObj>
               <ars:AcctAccessCode>
                  <!--You have a CHOICE of the next 3 items at this level-->
                  <arc:PrimaryIdentity>{{MSISDN}}</arc:PrimaryIdentity>
                  <ars:PayType>2</ars:PayType>
               </ars:AcctAccessCode>
            </ars:PaymentObj>
            <ars:PaymentInfo>
               <ars:CashPayment>
                  {% if PaymentMethod is not none %}<ars:PaymentMethod>{{PaymentMethod}}</ars:PaymentMethod>{% endif %}
                  <ars:Amount>{{Amount}}</ars:Amount>
                  {% if BankId is not none %}<ars:BankInfo>
                     <arc:BankCode>{{BankId}}</arc:BankCode>
                  </ars:BankInfo>{% endif %}
               </ars:CashPayment>
            </ars:PaymentInfo>
            {% if AU is not none %}<ars:AdditionalProperty>
               <arc:Code>CN_AU</arc:Code>
               <arc:Value>{{AU}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if BusinessType is not none %}<ars:AdditionalProperty>
               <arc:Code>CN_BUSINESSTYPE</arc:Code>
               <arc:Value>{{BusinessType}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if PaymentId is not none %}<ars:AdditionalProperty>
               <arc:Code>CN_PAYMENTID</arc:Code>
               <arc:Value>{{PaymentId}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if CallerID is not none %}<ars:AdditionalProperty>
               <arc:Code>CN_CALLERID</arc:Code>
               <arc:Value>{{CallerID}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
         </PaymentRequest>
      </ars:PaymentRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>